Repository: artemanufrij/graphui
Catalog: po/extra/*.po
Languages: fr, pt

source: Graph Visualization
fr: Visualisation de graphe
pt: Visualizador de Gráficos

source: graph;visual;draw;
fr: graphe;visuel;dessin;
pt: gráfico;visual;desenhar;

source: Graph visualization based on graphviz with included a text editor and a preview area
fr: Visualisation de graphe basée sur graphviz avec éditeur de texte et zone d'aperçu
pt: Visualizador de gráficos baseado no graphviz que incluía um editor de texto e uma antevisão de área

source: Supported types:
fr: Types supportés :
pt: Tipos suportados:

source: Shortcuts:
fr: Raccourcis :
pt: Atalhos:

source: F5: Compile
fr: F5 : Compiler
pt: F5: Compilar

source: Ctrl+N: New File
fr: Ctrl + N : Nouveau fichier
pt: Ctrl+N: Novo Ficheiro

source: Ctrl+O: Open File
fr: Ctrl + O : Ouvrir un fichier
pt: Ctrl+O: Abrir FIcheiro

source: Ctrl+S: Save File
fr: Ctrl + S : Enregistrer le fichier
pt: Ctrl+S: Guardar Ficheiro

source: Example
fr: Exemple
pt: Exemplo

source: Fix for flatpak
fr: Correction pour flatpak
pt: Correção para o flatpack

source: New:
fr: Nouveau :
pt: Novo:

source: Theme switcher
fr: Sélecteur de thème
pt: Alterar o Tema

source: Switched to meson
fr: Passage à meson
pt: Alteração para o meson

source: Fixed:
fr: Correction :
pt: Correções:

source: Restore correct window size
fr: Restauration de la taille de fenêtre correcte
pt: Restauro correto do tamanho da janela

source: Translation:
fr: Traduction :
pt: Traduções:

source: Dutch (by Heimen Stoffels)
fr: Néerlandais (par Heimen Stoffels)
pt: Holandês (por Heimen Stoffels)

source: Prepare for JUNO
fr: Préparation pour JUNO
pt: Preparação para o Juno

source: Added po/pot content for localization
fr: Ajout des fichiers po/pot pour la traduction
pt: Acionado conteúdo no po/pot para localização

source: Show Preview after saving
fr: Affichage de l'aperçu après sauvegarde
pt: Exibir antevisão depois de guardar

source: relative path for 'image' parameter
fr: Chemin relatif pour le paramètre « image »
pt: caminho relativo para o parâmetro de 'imagem'

source: Ctrl+S behaviour for opened file from 'Files'
fr: Comportement du raccourci Ctrl + S pour les fichiers ouverts depuis « Fichiers »
pt: Ctrl+S comportamento para ficheiro aberto a partir 'Ficheiros'

source: gschema file
fr: Fichier gschema
pt: ficheiro gschema

source: Export result as .svg or .png
fr: Exportez le résultat en .svg ou .png
pt: Exportar resultado como .svg ou .png

source: Option for 'autosave on closing'
fr: Option « Sauvegarder automatiquement à la fermeture »
pt: Opção para 'guardar automaticamente ao fechar'

source: Associate with MimeType text/vnd.graphviz
fr: Association avec le type MIME text/vnd.graphviz
pt: Associar com MimeType texto/vnd.graphviz

source: Open a graphviz file directly from Files
fr: Ouvrez un fichier graphviz directement depuis « Fichiers »
pt: Abrir um ficheiro graphviz diretamente dos ficheiros

source: Improvements:
fr: Améliorations :
pt: Melhorias:

source: Moved to SourceView for undo support
fr: Passage à SourceView pour le support des retours arrière
pt: Mudança para o SourceView para desfazer o suporte

source: Reload image after saving file
fr: Rechargement de l'image après l'enregistrement du fichier
pt: Recarregar imagem depois de guardar o ficheiro

source: Clear resutl image for 'New File'
fr: Effacement de l'image de résultat pour « Nouveau fichier »
pt: Limpar resultado de imagem para 'Novo Ficheiro'

source: Clear error message after successful compile
fr: Effacement des messages d'erreurs après compilation réussie
pt: Limpar mensagem de erro depois de completar a compilação com sucesso

source: Support for dot, neato, fdp, sfdp, twopi
fr: Prise en charge de dot, neato, fdp, sfdp, twopi
pt: Suporte para dot, neato, fdp, sfdp, twopi

source: Show details on error screen
fr: Affichage des détails sur les erreurs
pt: Exibir detalhes no ecrã de erro

source: Initial Release
fr: Version initiale
pt: Lançamento inicial
